In [1]:
import pandas as pd

In [2]:
#Series
x=pd.Series([1,2,3])
x

0    1
1    2
2    3
dtype: int64

In [3]:
x.array

<NumpyExtensionArray>
[np.int64(1), np.int64(2), np.int64(3)]
Length: 3, dtype: int64

In [4]:
x.index

RangeIndex(start=0, stop=3, step=1)

In [11]:
m=pd.Series([4,7,-5],index=['x','y',"z"])
m

x    4
y    7
z   -5
dtype: int64

In [12]:
#basics of indexing
#selecting and filtering
m['x']

np.int64(4)

In [13]:
m[['x','z']]

x    4
z   -5
dtype: int64

In [14]:
m[m>0]

x    4
y    7
dtype: int64

In [15]:
m*2

x     8
y    14
z   -10
dtype: int64

In [16]:
#dictionary to pandas series
sdata={"a":1,"b":2,"c":3,"d":4}
s=pd.Series(sdata)
s

a    1
b    2
c    3
d    4
dtype: int64

In [17]:
s.to_dict()

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [18]:
#dictionary to panda series
l=['a','x','u','b','c','d']
m=pd.Series(sdata,l)
m

a    1.0
x    NaN
u    NaN
b    2.0
c    3.0
d    4.0
dtype: float64

In [19]:
#missing values in pandas
pd.isna(m)

a    False
x     True
u     True
b    False
c    False
d    False
dtype: bool

In [21]:
pd.notna(m)

a     True
x    False
u    False
b     True
c     True
d     True
dtype: bool

In [22]:
data1={'odisha':17,'bengal':15}
data2={'odisha':4,'delhi':7}
d1=pd.Series(data1)
d2=pd.Series(data2)
d1+d2

bengal     NaN
delhi      NaN
odisha    21.0
dtype: float64

In [5]:
#dataframe creation
import pandas as pd
data={"state": ["delhi","gujarat","maharashtra","odisha","uttarakhand"],
      "cm": ["Atishi","bhupendra","eknath","mohan","pushkar"],
      "pop": ["1","2","3","4","5"]}
frame=pd.DataFrame(data)
frame

         state         cm pop
0        delhi     Atishi   1
1      gujarat  bhupendra   2
2  maharashtra     eknath   3
3       odisha      mohan   4
4  uttarakhand    pushkar   5

In [6]:
frame.head()

         state         cm pop
0        delhi     Atishi   1
1      gujarat  bhupendra   2
2  maharashtra     eknath   3
3       odisha      mohan   4
4  uttarakhand    pushkar   5

In [7]:
frame.tail()

         state         cm pop
0        delhi     Atishi   1
1      gujarat  bhupendra   2
2  maharashtra     eknath   3
3       odisha      mohan   4
4  uttarakhand    pushkar   5

In [9]:
frame.columns

Index(['state', 'cm', 'pop'], dtype='object')

In [10]:
frame1=pd.DataFrame(data,columns=["cm","pop","state","loanamt"])
frame1

          cm pop        state loanamt
0     Atishi   1        delhi     NaN
1  bhupendra   2      gujarat     NaN
2     eknath   3  maharashtra     NaN
3      mohan   4       odisha     NaN
4    pushkar   5  uttarakhand     NaN

In [11]:
frame1['state']

0          delhi
1        gujarat
2    maharashtra
3         odisha
4    uttarakhand
Name: state, dtype: object

In [14]:
frame1['loanamt']=23
frame1

          cm pop        state  loanamt
0     Atishi   1        delhi       23
1  bhupendra   2      gujarat       23
2     eknath   3  maharashtra       23
3      mohan   4       odisha       23
4    pushkar   5  uttarakhand       23

In [15]:
frame1['loanamt']=[1,2,3,4,5]
frame1

          cm pop        state  loanamt
0     Atishi   1        delhi        1
1  bhupendra   2      gujarat        2
2     eknath   3  maharashtra        3
3      mohan   4       odisha        4
4    pushkar   5  uttarakhand        5

In [18]:
val=pd.Series([1.1,1.2,1.3],index=[0,1,3])
frame1['loanamt']=val
frame1

          cm pop        state  loanamt
0     Atishi   1        delhi      1.1
1  bhupendra   2      gujarat      1.2
2     eknath   3  maharashtra      NaN
3      mohan   4       odisha      1.3
4    pushkar   5  uttarakhand      NaN

In [19]:
frame1['capital']='bhubaneswar'
frame1

          cm pop        state  loanamt      capital
0     Atishi   1        delhi      1.1  bhubaneswar
1  bhupendra   2      gujarat      1.2  bhubaneswar
2     eknath   3  maharashtra      NaN  bhubaneswar
3      mohan   4       odisha      1.3  bhubaneswar
4    pushkar   5  uttarakhand      NaN  bhubaneswar

In [23]:
gdp={"india":{2015:2.1,2020:2.1,2025:5},
    "usa":{2015:18.4,2020:21.6,2025:25},
    "japan":{2015:4.4,2020:5.0,2025:5.4}}
frame3=pd.DataFrame(gdp)
frame3

      india   usa  japan
2015    2.1  18.4    4.4
2020    2.1  21.6    5.0
2025    5.0  25.0    5.4

In [25]:
import numpy as np
a=np.array([[1,2],[3,4],[5,6]])
a=pd.DataFrame(a,index=['r1','r2','r3'],columns=['c1','c2'])
a

    c1  c2
r1   1   2
r2   3   4
r3   5   6

In [28]:
data=[['virat',35],['dhoni',42],['shubnam',24]]
df=pd.DataFrame(data,columns=['name','age'])
df

      name  age
0    virat   35
1    dhoni   42
2  shubnam   24

In [29]:
data=[{'a':1,'b':2,'c':3},
     {'a':10,'b':20,'c':30,'d':7}]
df=pd.DataFrame(data)
df

    a   b   c    d
0   1   2   3  NaN
1  10  20  30  7.0

In [30]:
#index objects in pandas
df=pd.DataFrame(['a','b','c'],index=[1,2,3])
I=df.index
print(I[2])

3

In [34]:
print(I.shape)
print(I.size)
print(I.dtype)
print(I.ndim)

(3,)
3
int64
1

In [36]:
labels=pd.Index(np.arange(1,4))
print(labels)
pd.Series([1.5,-2.5,0],index=labels)

Index([1, 2, 3], dtype='int64')

1    1.5
2   -2.5
3    0.0
dtype: float64

In [39]:
I1=pd.Index([1,2,3,4,5,6])
I2=pd.Index([3,4,5,6,7,8])
print(I1.union(I2))
print(I1.intersection(I2))
print(I1.symmetric_difference(I2))
print(I1.append(I2))

Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64')
Index([3, 4, 5, 6], dtype='int64')
Index([1, 2, 7, 8], dtype='int64')
Index([1, 2, 3, 4, 5, 6, 3, 4, 5, 6, 7, 8], dtype='int64')

In [42]:
frame=pd.DataFrame(np.arange(9).reshape(3,3),index=["i","ii","iii"],columns=["A","B","c"])
frame

     A  B  c
i    0  1  2
ii   3  4  5
iii  6  7  8

In [44]:
frame2=frame.reindex(["i","iii","ii"])
frame2

     A  B  c
i    0  1  2
iii  6  7  8
ii   3  4  5

In [45]:
frame2=frame.reindex(columns=['A','B'])
frame2

     A  B
i    0  1
ii   3  4
iii  6  7

In [46]:
frame2=frame.reindex(["c","a","d","b"],axis=1)
frame2

     c   a   d   b
i    2 NaN NaN NaN
ii   5 NaN NaN NaN
iii  8 NaN NaN NaN

In [47]:
frame2=frame.reindex(["ii","a","d","i"],axis=0)
frame2

      A    B    c
ii  3.0  4.0  5.0
a   NaN  NaN  NaN
d   NaN  NaN  NaN
i   0.0  1.0  2.0

In [48]:
frame2=frame.reindex(["ii","a","d","i"],axis=0,fill_value=7)
frame2

    A  B  c
ii  3  4  5
a   7  7  7
d   7  7  7
i   0  1  2

In [50]:
frame1=pd.Series(["a","b","c"],index=[0,2,4])
frame1

0    a
2    b
4    c
dtype: object

In [54]:
x = frame1.reindex(np.arange(6))
x

0      a
1    NaN
2      b
3    NaN
4      c
5    NaN
dtype: object

In [55]:
x = frame1.reindex(np.arange(6),method="ffill")
x

0    a
1    a
2    b
3    b
4    c
5    c
dtype: object

In [56]:
x = frame1.reindex(np.arange(6),method="bfill")
x

0      a
1      b
2      b
3      c
4      c
5    NaN
dtype: object

In [57]:
#dropping entries from an axis
df=pd.DataFrame(np.arange(16).reshape(4,4),
            index=["aee","bee","cee","dee"],
            columns=["one","two","three","four"])
df

     one  two  three  four
aee    0    1      2     3
bee    4    5      6     7
cee    8    9     10    11
dee   12   13     14    15

In [59]:
df.drop('aee')

     one  two  three  four
bee    4    5      6     7
cee    8    9     10    11
dee   12   13     14    15

In [61]:
#indexing,selection,filter in series
obj=pd.Series(np.arange(4),index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [62]:
print(obj[2:4])

c    2
d    3
dtype: int64

In [64]:
#indexing in dataframe
data=pd.DataFrame(np.arange(16).reshape(4,4),
index=['r1','r2','r3','r4'],
columns=['c1','c2','c3','c4'])
data

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [65]:
data['c1']

r1     0
r2     4
r3     8
r4    12
Name: c1, dtype: int64

In [66]:
data[['c1','c3']]

    c1  c3
r1   0   2
r2   4   6
r3   8  10
r4  12  14

In [67]:
data[:2]

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7

In [68]:
data>5

       c1     c2     c3     c4
r1  False  False  False  False
r2  False  False   True   True
r3   True   True   True   True
r4   True   True   True   True

In [69]:
data[data['c3']>3]

    c1  c2  c3  c4
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [70]:
data[data['c3']>3]=10
data

    c1  c2  c3  c4
r1   0   1   2   3
r2  10  10  10  10
r3  10  10  10  10
r4  10  10  10  10

In [71]:
#loc and iloc
df=pd.DataFrame([[1,2],[4,5],[7,8]],
               index=['cobra','viper','ratsnake'],
               columns=['maxspeed','length'])
df

          maxspeed  length
cobra            1       2
viper            4       5
ratsnake         7       8

In [72]:
df.loc['viper']

maxspeed    4
length      5
Name: viper, dtype: int64

In [74]:
df.loc[['viper','cobra']]

       maxspeed  length
viper         4       5
cobra         1       2

In [75]:
df.loc['viper','length']

np.int64(5)

In [76]:
df.loc['cobra':'viper','maxspeed']

cobra    1
viper    4
Name: maxspeed, dtype: int64

In [78]:
df.loc[[False,False,True]]

          maxspeed  length
ratsnake         7       8

In [79]:
df.loc[df['length']>6]

          maxspeed  length
ratsnake         7       8

In [80]:
data.iloc[0]

c1    0
c2    1
c3    2
c4    3
Name: r1, dtype: int64

In [81]:
data.iloc[:,0]

r1     0
r2    10
r3    10
r4    10
Name: c1, dtype: int64

In [82]:
data.iloc[[1,3]]

    c1  c2  c3  c4
r2  10  10  10  10
r4  10  10  10  10

In [84]:
#function application and mapping
df=pd.DataFrame([[4,9]]*3,
              columns=['a','b'])
df

   a  b
0  4  9
1  4  9
2  4  9

In [85]:
df.apply(np.sum,axis=0)

a    12
b    27
dtype: int64

In [86]:
df.apply(np.sum,axis=1)

0    13
1    13
2    13
dtype: int64

In [91]:
def f1(x):
    return x.max()-x.min()
df.apply(f1,axis=1)

0    5
1    5
2    5
dtype: int64

In [92]:
def f1(x):
    return x.max()-x.min()
df.apply(f1,axis=0)

a    0
b    0
dtype: int64

In [99]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [100]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [98]:
#arithmetic and data alignment
df1=pd.DataFrame(np.arange(12).reshape((3,4)),columns=list("abcd"))
df1

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [101]:
df2=pd.DataFrame(np.arange(20).reshape((4,5)),columns=list("abcde"))
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [102]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [103]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [104]:
df2.loc[1,"b"]=np.nan
df1.loc[1,"b"]=np.nan
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   NaN  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [105]:
1/df1==df1.rdiv(1)

      a      b     c     d
0  True   True  True  True
1  True  False  True  True
2  True   True  True  True

In [106]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),
                   index=["three","one"],
                   columns=["d","a","b","c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [107]:
frame.sort_index(axis='index')

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [108]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [113]:
x = frame.sort_index(axis="columns",ascending=False)
x

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [114]:
obj=pd.Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [115]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [116]:
obj.sort_values(na_position="first")

2   -3
3    2
0    4
1    7
dtype: int64

In [117]:
frame=pd.DataFrame({"a": [-4,7,3,2],
                   "b": [0,1,0,1]})
frame

   a  b
0 -4  0
1  7  1
2  3  0
3  2  1

In [119]:
frame.sort_values(['a','b'])

   a  b
0 -4  0
3  2  1
2  3  0
1  7  1

In [120]:
obj=pd.Series([2,3,1])
print(obj.rank())

0    2.0
1    3.0
2    1.0
dtype: float64

In [123]:
obj=pd.Series([3,2,3,1])
obj.rank()

0    3.5
1    2.0
2    3.5
3    1.0
dtype: float64

In [124]:
#statistics
df=pd.DataFrame(np.random.randn(9).reshape((3,3)))
df

          0         1         2
0  0.052791 -0.658120 -1.431774
1 -0.739803  0.782341 -1.809326
2 -0.739796 -1.650742 -0.096614

In [125]:
df.sum()

0   -1.426808
1   -1.526522
2   -3.337714
dtype: float64

In [126]:
df.sum(axis=0)

0   -1.426808
1   -1.526522
2   -3.337714
dtype: float64

In [127]:
df.sum(axis=1)

0   -2.037104
1   -1.766788
2   -2.487152
dtype: float64

In [128]:
df.mean(axis=1)

0   -0.679035
1   -0.588929
2   -0.829051
dtype: float64

In [129]:
df.cumsum()

          0         1         2
0  0.052791 -0.658120 -1.431774
1 -0.687012  0.124221 -3.241100
2 -1.426808 -1.526522 -3.337714

In [132]:
obj.describe()

count    4.000000
mean     2.250000
std      0.957427
min      1.000000
25%      1.750000
50%      2.500000
75%      3.000000
max      3.000000
dtype: float64